<!DOCTYPE html>
<html lang="ru">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <link href="https://cdn.jsdelivr.net/npm/bootstrap@5.1.3/dist/css/bootstrap.min.css" rel="stylesheet" integrity="sha384-1BmE4kWBq78iYhFldvKuhfTAU6auU8tT94WrHftjDbrCEXSU1oBoqyl2QvZ6jIW3" crossorigin="anonymous">
    <meta http-equiv="X-UA-Compatible" content="ie=edge">
    <link rel="stylesheet" href="General.css">
    <title>Oge</title>
  <style>
       body {
    background-color: #b0d9c4;
   }
  </style>
</head>
<body>
  <div class="hamburger">
    <div class="bar"></div>
    <div class="bar"></div>
    <div class="bar"></div>
  </div>
<div class="sidenav">
    <a href="index.html">О Python</a>
    <a href="sintaksis.html">Синтаксис</a>
    <a href="practice.html">Практика по написанию простых программ</a>
    <a href="cycles.html">Циклы "for" и "while"</a>
    <a href="oge.html" class = 'active'>Задачи из ОГЭ по информатике</a>
    <a href="otpravka.html">Обратная связь</a>
    <a href="items.html">Магазин</a>
    <a href="index.html">На главную</a>
  </div>
  <div class="main">
   <H2>Примеры выполнения задач ОГЭ по информатике на программирование</h2>
   <H3>Задача 1.</h3>
    <p>Напишите программу, которая в последовательности натуральных чисел находит среднее арифметическое двузначных чисел или сообщает, что таких чисел нет (выводит «NO»). Программа получает на вход натуральные числа, количество введённых чисел неизвестно, последовательность чисел заканчивается числом 0 (0 — признак окончания ввода, не входит в последовательность).</p>
    <p>Количество чисел не превышает 100. Введённые числа не превышают 300.</p>
    <p>Программа должна вывести среднее арифметическое двузначных чисел или вывести «NO», если таких чисел нет. Значение выводить с точностью до десятых.</p>
   <H3>Задача 2.</h3>
    <p>Напишите программу, которая в последовательности натуральных чисел определяет количество чисел, оканчивающихся на 9. Программа получает на вход количество чисел в последовательности, а затем сами числа. В последовательности всегда имеется число, оканчивающееся на 9.</p>
    <p>Количество чисел не превышает 1000. Введённые числа по модулю не превышают 30000.</p>
    <p>Программа должна вывести одно число: количество чисел, оканчивающихся на 9.</p>
  <style>
    .del { display: none; }
    .del:not(:checked) + label + * { display: none; }
    .del:not(:checked) + label,
    .del:checked + label {
    display: inline-block;
    padding: 2px 10px;
    border-radius: 2px;
    color: #fff;
    background: #4e6473;
    cursor: pointer;
    }
    .del:checked + label {
    background: #e36443;
    }
    </style>
    <input type="checkbox" id="raz" class="del"/>
    <label for="raz" class="del">Показать решение задач</label><div>
      <strong><table border="1">
        <p><font face="Times New Roman" style="font-size:130%">Решение задачи 1:</p>
        <table border="2">
         <tr>
           <td><p>a = int(input())</p>
             <p>sum = 0</p>
             <p>k = 0</p>
             <p>while a != 0:</p>
             <p align="center">if a > 9 and a < 100:</p>
             <p align="center">sum = sum + a</p>
             <p align="center">k = k + 1</p>
             <p>a = int(input())</p>
             <p>if k > 0:</p>
             <p align="center">print(sum/k)</p>
             <p>if k > 0:</p>
             <p align="center">print("NO")</p>
           </td>
         </tr>
        </table>
        <p>Решение задачи 2:</p>
        <table border="2">
         <tr>
           <td><p>n = int(input())</p>
             <p>k = 0</p>
             <p>for i in range(n):</p>
             <p align="center">a = int(input())</p>
             <p align="center">if a % 10 == 9:</p>
             <p align="center">k = k +1</p>
             <p>print(k)</p>
           </td>
         </tr>
        </table>
      </strong> 
    </div>
    <script>
      document.addEventListener("DOMContentLoaded", function () {
        const hamburger = document.querySelector(".hamburger");
        const sidenav = document.querySelector(".sidenav");
    
        hamburger.addEventListener("click", function () {
          sidenav.classList.toggle("active");
        });
      });
    </script>
</body>
</html>